Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70N19B.PIC
      <edc:SFRDef edc:_addr="0x40050548" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ2" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005054C" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ3" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050550" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ4" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050554" edc:access="-nnnnnnnnnnnnnnnnnnnnnnn-nnn-nnn" edc:cname="GMAC_ST2RPQ5" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QNB" edc:desc="Queue Number (0-2)" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANP" edc:desc="VLAN Priority" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VLANE" edc:desc="VLAN Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2ETH" edc:desc="Index of Screening Type 2 EtherType register x" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHE" edc:desc="EtherType Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPA" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPAE" edc:desc="Compare A Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPB" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPBE" edc:desc="Compare B Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COMPC" edc:desc="Index of Screening Type 2 Compare Word 0/Word 1 register x" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="COMPCE" edc:desc="Compare C Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
